reddit/app/views/posts/edit.html.erb

  <% debugger %>
  <% @post.subs.each do |sub| %>
---
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]