reddit/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
  <h4>Subs</h4>
  <% Sub.all.each do |sub| %>